Revit 2027 API
IExternalEventHandler Methods
The IExternalEventHandler type exposes the following members.
Methods
Name | Description
Execute |  This method is called to handle the external event.
GetName |  String identification of the event handler.
Top
See Also
Reference
IExternalEventHandler Interface
Autodesk.Revit.UI Namespace